EDT/УТ/src/InformationRegisters/СтатусыОборудования/СтатусыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЕдиницыОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеПовреждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КомплектыОборудования/КомплектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ОперативноеНазначениеТАНаРейс/ОперативноеНазначениеТАНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперативноеНазначениеТАНаРейс</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ТелефонныеАппаратыТранспорта/ТелефонныеАппаратыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелефонныеАппаратыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыОборудования/ТипыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОборудования</name>
  <enumValues>
    <name>ПринтерЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>Смартфон</name>
  </enumValues>
  <enumValues>
    <name>Планшет</name>
  </enumValues>
  <enumValues>
    <name>ТерминалПриемаОплатыПоКарте</name>
  </enumValues>
  <enumValues>
    <name>SIMКарта</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СостоянияЕдиницыОборудования/СостоянияЕдиницыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЕдиницыОборудования</name>
  <enumValues>
    <name>Выдано</name>
  </enumValues>
  <enumValues>
    <name>Сдано</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УстановкаСтатусаОборудования/УстановкаСтатусаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаОборудования</name>
  <registerRecords>AccumulationRegister.УчетОстатковОборудования</registerRecords>
  <registerRecords>InformationRegister.СтатусыОборудования</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/новаВодители/новаВодители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаВодители</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентОпытности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наемный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТранспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТелефон</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПешийКурьер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДВнешнегоОператораМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОпытности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/CommonModules/УчетОборудованияСервер/Module.bsl
Функция ПолучитьРегионыВыбора(БезУчетаПараметраСеанса = Ложь) Экспорт
	
	Если БезУчетаПараметраСеанса Или ПараметрыСеанса.ТерминалДоставки.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РегиональныеТерминалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы
		|ГДЕ
		|	НЕ РегиональныеТерминалы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегиональныеТерминалы.Наименование";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//CeHbKA #2995 08.04.2019
//Параметры:
//	СтатусОборудования = Перечисления.СтатусыЕдиницыОборудования;
//	СписокОборудования = Массив
Функция СоздатьНовыйДокументУстановкаСтатусаОборудования(СтатусОборудования, СписокОборудования, Регион = Неопределено) Экспорт 

	НовыйДок = Документы.УстановкаСтатусаОборудования.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если Регион = Неопределено Тогда
		НовыйДок.Регион = ПараметрыСеанса.ТерминалДоставки;
	Иначе
		НовыйДок.Регион = Регион;
	КонецЕсли;
	
	НовыйДок.СтатусОборудования = СтатусОборудования;
	
	Для каждого ТекОборудования Из СписокОборудования Цикл
		НС = НовыйДок.СписокОборудования.Добавить();
		НС.Оборудование = ТекОборудования;
	КонецЦикла; 

	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат НовыйДок.Ссылка;
	
КонецФункции // () 

Функция ПолучитьСтатусОборудования(Период, Оборудование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	СтатусыОборудованияСрезПоследних.СтатусОборудования КАК СтатусОборудования
		|ИЗ
		|	РегистрСведений.СтатусыОборудования.СрезПоследних(&Период, Оборудование = &Оборудование) КАК СтатусыОборудованияСрезПоследних";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтатусОборудования;
	КонецЦикла;
	
	Возврат Перечисления.СтатусыЕдиницыОборудования.ПустаяСсылка();
	
КонецФункции // ()

Функция ПолучитьСоответствиеОборудованияНаСервере(Код) Экспорт 
	
	СоответствиеОборудования = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оборудование.Ссылка КАК Оборудование,
		|	Оборудование.МодельОборудования.ТипОборудования КАК ТипОборудования
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|ГДЕ
		|	НЕ Оборудование.ПометкаУдаления
		|	И Оборудование.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеОборудования.Вставить(ВыборкаДетальныеЗаписи.ТипОборудования, ВыборкаДетальныеЗаписи.Оборудование);
	КонецЦикла;

	Возврат СоответствиеОборудования;
	
КонецФункции // ()

//CeHbKA #2995 08.04.2019

//Марочкин 25.04.2019
Функция ПользователюВключенаРаботаСУчетомОборудования() Экспорт
	Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РабочееМестоУчетаОборудования");
КонецФункции
//Марочкин 25.04.2019

//CeHbKA #3471 17.09.2019
Функция ПолучитьДанныеРейсаПоВыданномуОборудованию(Код) Экспорт

	СоответствиеОборудования = ПолучитьСоответствиеОборудованияНаСервере(Код);
	
	Оборудование = Справочники.Оборудование.ПустаяСсылка();
	
	Для каждого СтрокаОборудование Из СоответствиеОборудования Цикл
		Оборудование = СтрокаОборудование.Значение;
	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетОборудованияСрезПоследних.Период КАК Период,
	|	УчетОборудованияСрезПоследних.Регистратор КАК Регистратор,
	|	УчетОборудованияСрезПоследних.Оборудование КАК Оборудование,
	|	УчетОборудованияСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	УчетОборудованияСрезПоследних.Рейс КАК Рейс,
	|	УчетОборудованияСрезПоследних.Рейс.ДатаРейса КАК ДатаРейса,
	|	УчетОборудованияСрезПоследних.Рейс.ТерминалДоставки КАК ТерминалДоставки,
	|	УчетОборудованияСрезПоследних.СостояниеЕдиницыОборудования КАК СостояниеЕдиницыОборудования,
	|	УчетОборудованияСрезПоследних.ОборудованиеПовреждено КАК ОборудованиеПовреждено,
	|	УчетОборудованияСрезПоследних.Пользователь КАК Пользователь,
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт, ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)) КАК Транспорт,
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК Водитель,
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК Экспедитор,
	|	ЕСТЬNULL(КомплектыОборудования_Смартфон.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Смартфон,
	|	ЕСТЬNULL(КомплектыОборудования_Принтер.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Принтер,
	|	ЕСТЬNULL(КомплектыОборудования_Терминал.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Терминал
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	РегистрСведений.УчетОборудования.СрезПоследних(, Оборудование = &Оборудование) КАК УчетОборудованияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	|		ПО (ПривязкаМашинКРейсамСрезПоследних.Рейс = УчетОборудованияСрезПоследних.Рейс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Смартфон
	|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Смартфон.Транспорт)
	|			И (КомплектыОборудования_Смартфон.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.Смартфон))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Принтер
	|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Принтер.Транспорт)
	|			И (КомплектыОборудования_Принтер.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ПринтерЭтикеток))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Терминал
	|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Терминал.Транспорт)
	|			И (КомплектыОборудования_Терминал.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ТерминалПриемаОплатыПоКарте))
	|ГДЕ
	|	УчетОборудованияСрезПоследних.СостояниеЕдиницыОборудования = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_1.Рейс КАК Рейс,
	|	ВТ_1.ДатаРейса КАК ДатаРейса,
	|	ВТ_1.ТерминалДоставки КАК ТерминалДоставки,
	|	ВТ_1.Транспорт КАК Транспорт,
	|	ВТ_1.Транспорт.Родитель КАК ТипЭкипажа,
	|	ВТ_1.Водитель КАК Водитель,
	|	ВТ_1.ФизЛицо КАК ФизЛицо,
	|	ЕСТЬNULL(БэйджиСотрудников.КодСотрудника, """") КАК БэйджВодителя,
	|	ВТ_1.Экспедитор КАК Экспедитор,
	|	ВТ_1.Комплект_Смартфон КАК Комплект_Смартфон,
	|	ВТ_1.Комплект_Принтер КАК Комплект_Принтер,
	|	ВТ_1.Комплект_Терминал КАК Комплект_Терминал,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперативноеНазначениеТАНаРейсСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТелефонныеАппаратыТранспортаСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ОперативноеНазначениеТАНаРейсСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка))
	|	КОНЕЦ КАК Телефон
	|ПОМЕСТИТЬ ВТ_2
	|ИЗ
	|	ВТ_1 КАК ВТ_1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	|		ПО ВТ_1.Водитель = БэйджиСотрудников.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперативноеНазначениеТАНаРейс.СрезПоследних(
	|				,
	|				Рейс В
	|					(ВЫБРАТЬ
	|						ВТ_1.Рейс
	|					ИЗ
	|						ВТ_1 КАК ВТ_1)) КАК ОперативноеНазначениеТАНаРейсСрезПоследних
	|		ПО ВТ_1.Рейс = ОперативноеНазначениеТАНаРейсСрезПоследних.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних(
	|				,
	|				Транспорт В
	|					(ВЫБРАТЬ
	|						ВТ_1.Транспорт
	|					ИЗ
	|						ВТ_1 КАК ВТ_1)) КАК ТелефонныеАппаратыТранспортаСрезПоследних
	|		ПО ВТ_1.Транспорт = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_2.Рейс КАК Рейс,
	|	ВТ_2.ДатаРейса КАК ДатаРейса,
	|	ВТ_2.ТерминалДоставки КАК ТерминалДоставки,
	|	ВТ_2.Транспорт КАК Транспорт,
	|	ВТ_2.ТипЭкипажа КАК ТипЭкипажа,
	|	ВТ_2.Водитель КАК Водитель,
	|	ВТ_2.ФизЛицо КАК ФизЛицо,
	|	ВТ_2.БэйджВодителя КАК БэйджВодителя,
	|	ВТ_2.Экспедитор КАК Экспедитор,
	|	ВТ_2.Комплект_Смартфон КАК Комплект_Смартфон,
	|	ВТ_2.Комплект_Принтер КАК Комплект_Принтер,
	|	ВТ_2.Комплект_Терминал КАК Комплект_Терминал,
	|	ВТ_2.Телефон КАК Телефон,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Смартфон,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Смартфон,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.ОборудованиеПовреждено, ЛОЖЬ) КАК Смартфон_Поврежден,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Принтер,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Принтер,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.ОборудованиеПовреждено, ЛОЖЬ) КАК Принтер_Поврежден,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Терминал,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Терминал,
	|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.ОборудованиеПовреждено, ЛОЖЬ) КАК Терминал_Поврежден
	|ПОМЕСТИТЬ ВТ_3
	|ИЗ
	|	ВТ_2 КАК ВТ_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
	|				,
	|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
	|					(ВЫБРАТЬ
	|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.Смартфон),
	|						ВТ_2.Рейс КАК Рейс
	|					ИЗ
	|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Смартфон
	|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Смартфон.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
	|				,
	|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
	|					(ВЫБРАТЬ
	|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ПринтерЭтикеток),
	|						ВТ_2.Рейс КАК Рейс
	|					ИЗ
	|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Принтер
	|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Принтер.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
	|				,
	|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
	|					(ВЫБРАТЬ
	|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ТерминалПриемаОплатыПоКарте),
	|						ВТ_2.Рейс КАК Рейс
	|					ИЗ
	|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Терминал
	|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Терминал.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_3.Рейс КАК Рейс,
	|	ВТ_3.ДатаРейса КАК ДатаРейса,
	|	ВТ_3.ТерминалДоставки КАК ТерминалДоставки,
	|	ВТ_3.Транспорт КАК Транспорт,
	|	ВТ_3.ТипЭкипажа КАК ТипЭкипажа,
	|	ВТ_3.Водитель КАК Водитель,
	|	ВТ_3.ФизЛицо КАК ФизЛицо,
	|	ВТ_3.БэйджВодителя КАК БэйджВодителя,
	|	ВТ_3.Экспедитор КАК Экспедитор,
	|	ВТ_3.Комплект_Смартфон КАК Комплект_Смартфон,
	|	ВТ_3.Комплект_Принтер КАК Комплект_Принтер,
	|	ВТ_3.Комплект_Терминал КАК Комплект_Терминал,
	|	ВТ_3.Телефон КАК Телефон,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
	|			ТОГДА ВТ_3.Оборудование_Смартфон
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Смартфон_Получено,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
	|			ТОГДА ВТ_3.Оборудование_Смартфон
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Смартфон_Сдано,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
	|			ТОГДА ВТ_3.Оборудование_Принтер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Принтер_Получено,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
	|			ТОГДА ВТ_3.Оборудование_Принтер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Принтер_Сдано,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
	|			ТОГДА ВТ_3.Оборудование_Терминал
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Терминал_Получено,
	|	ВЫБОР
	|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
	|			ТОГДА ВТ_3.Оборудование_Терминал
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|	КОНЕЦ КАК Терминал_Сдано,
	|	ВТ_3.Смартфон_Поврежден КАК Смартфон_Поврежден,
	|	ВТ_3.Терминал_Поврежден КАК Терминал_Поврежден,
	|	ВТ_3.Принтер_Поврежден КАК Принтер_Поврежден,
	|	ВТ_3.Оборудование_Смартфон КАК Смартфон_Оборудование,
	|	ВТ_3.Состояние_Смартфон КАК Смартфон_Состояние,
	|	ВТ_3.Оборудование_Принтер КАК Принтер_Оборудование,
	|	ВТ_3.Состояние_Принтер КАК Принтер_Состояние,
	|	ВТ_3.Оборудование_Терминал КАК Терминал_Оборудование,
	|	ВТ_3.Состояние_Терминал КАК Терминал_Состояние
	|ИЗ
	|	ВТ_3 КАК ВТ_3";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПараметрыРейса = Новый Структура();	
	ПараметрыРейса.Вставить("Рейс");
	ПараметрыРейса.Вставить("Транспорт");
	ПараметрыРейса.Вставить("Смартфон_Получено");
	ПараметрыРейса.Вставить("Терминал_Получено");
	ПараметрыРейса.Вставить("Принтер_Получено");
	ПараметрыРейса.Вставить("СостояниеОборудования", Перечисления.СостоянияЕдиницыОборудования.Выдано);
	ПараметрыРейса.Вставить("ФизЛицо");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыРейса, ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
	Возврат ПараметрыРейса;
	
КонецФункции // ()
//CeHbKA #3471 17.09.2019

//Переварюха В.В. Задача № 3535 2019.09.26
Функция ПоРейсуСуществуетВыданноеОборудование(Рейс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетОборудованияСрезПоследних.Период КАК Период,
		|	УчетОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	УчетОборудованияСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	УчетОборудованияСрезПоследних.Рейс КАК Рейс,
		|	УчетОборудованияСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.УчетОборудования.СрезПоследних(, Рейс = &Рейс) КАК УчетОборудованияСрезПоследних
		|ГДЕ
		|	УчетОборудованияСрезПоследних.СостояниеЕдиницыОборудования = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)";
		
		
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ()

Функция ПоРейсуИФизЛицуСуществуетВыданноеОборудование(Рейс,ФизЛицо) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетОборудованияСрезПоследних.Период КАК Период,
		|	УчетОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	УчетОборудованияСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	УчетОборудованияСрезПоследних.Рейс КАК Рейс,
		|	УчетОборудованияСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.УчетОборудования.СрезПоследних(
		|			,
		|			Рейс = &Рейс
		|				И ФизЛицо = &ФизЛицо) КАК УчетОборудованияСрезПоследних
		|ГДЕ
		|	УчетОборудованияСрезПоследних.СостояниеЕдиницыОборудования = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)";
		
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ()

Функция ПолучитьСписокФизЛицПоРейсу(Рейс) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаМашинКРейсамСрезПоследних.Водитель.ФизЛицо КАК ВодительФизЛицо,
		|	ПривязкаМашинКРейсамСрезПоследних.Экспедитор.ФизЛицо КАК ЭкспедиторФизЛицо
		|ИЗ
		|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокФизЛиц = Новый Структура;
	СписокФизЛиц.Вставить("ВодительФизЛицо");
	СписокФизЛиц.Вставить("ЭкспедиторФизЛицо");
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаФизЛицо = РезультатЗапроса.Выбрать();
	
		ВыборкаФизЛицо.Следующий();
		
		ЗаполнитьЗначенияСвойств(СписокФизЛиц, ВыборкаФизЛицо);
		//СписокФизЛиц.Вставить("ВодительФизЛицо", ВыборкаФизЛицо.ВодительФизЛицо);
		//СписокФизЛиц.Вставить("ЭкспедиторФизЛицо",ВыборкаФизЛицо.ЭкспедиторФизЛицо);
		
	КонецЕсли;
	
	Возврат СписокФизЛиц;

КонецФункции // ПолучитьСписокФизЛицПоРейсу()

//Переварюха В.В. Задача № 3535 2019.09.26
